/*======================================
■■■ 실행 흐름의 컨트롤(제어문) ■■■
- 반복문(for문) 실습 및 관찰
======================================*/

// 1 부터 100 까지의 정수 중에서
// 4의 배수만 출력하는 프로그램을 구현한다.
// 단, for 문을 활용해야 하며
// 한 줄에 5개씩만 출력할 수 있도록 한다.

// 실행 예)
// 4   8   12  16  20
// 24  28  32  36  40
//			:
//			.....  100
// 계속하려면 아무 키나 누르세요...

public class Test057
{
	public static void main(String[] args)
	{

		for (int n=4;n<=100;n+=4)
		{
			System.out.printf("%4d", n);
			if (n%20==0)					//-- 출력 구문이 4*5의 배수가 될 때마다
			{
				System.out.println();		//-- 개행
			}

		}



		/*================================
		int n;
		for (n=1;n<=25;n++)
		{

			System.out.printf("%5d   ",4*n);
			if (n % 5 == 0)
			{
				System.out.println("");
			}
		}
		=================================*/
		

	}
}

// 실행 결과

/*
   4   8  12  16  20
  24  28  32  36  40
  44  48  52  56  60
  64  68  72  76  80
  84  88  92  96 100
계속하려면 아무 키나 누르십시오 . . .

*/