/*===========================================
■■■ 실행 흐름의 컨트롤(제어문) ■■■
=============================================*/

// continue 실습

// continue 를 활용하여
// 다음과 같은 처리와 출력이 이루어질 수 있도록
// 프로그램을 구현한다.

// 실행 예)
/*
1 : 1
3 : 4
5 : 9
7 : 16
9 : 25
  :
  :
99 : 2500
계속하려면 아무 키나 누르세요...
*/

public class Test065
{
	public static void main(String[] args)
	{
		int sum=0;
		int i;

		for (i=1;i<=99;i++)
		{
			if (i%2==0)								//-- n 이 짝수라면...
			{
				continue;							//-- (뒷부분 무시하고) + 계속해라
			}
			sum += i;								//-- 뒷부분
			System.out.printf("%d : %d\n",i,sum);	//-- 뒷부분
		}
		


		
	}
}

// 실행 결과

/*
31 : 256
33 : 289
35 : 324
37 : 361
39 : 400
41 : 441
43 : 484
45 : 529
47 : 576
49 : 625
51 : 676
53 : 729
55 : 784
57 : 841
59 : 900
61 : 961
63 : 1024
65 : 1089
67 : 1156
69 : 1225
71 : 1296
73 : 1369
75 : 1444
77 : 1521
79 : 1600
81 : 1681
83 : 1764
85 : 1849
87 : 1936
89 : 2025
91 : 2116
93 : 2209
95 : 2304
97 : 2401
99 : 2500
계속하려면 아무 키나 누르십시오 . . .
*/